// - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
//
// let calc = (arr) =>{
//     let min = arr[0];
//     for (const minElement of arr) {
//         if (minElement < min)
//             min = minElement;
//     }
//     return min;
// }
// console.log(calc(2, 5, -3));
// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
// - створити функцію яка повертає найбільше число з масиву
let foo = (...xxx) => {
    let min = 0;
    for (const item of xxx) {
        if (item < min) min = item;
    }
    return min;
}
foo(1,3,4,56,7,8,9);
console.log();
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13